note.tex

Following set of equations is an equivalent of \(x(a,b)+y(c,d)=O\),
$$\begin{aligned}
ax+cy&=0 && (1)\\
bx+dy&=0 && (2)\\
\end{aligned}$$
$$\begin{aligned}
(1)\times d-(2)\times c\Rightarrow (ad-cb)x+cdy-cdy &= 0\\
(ad-cb)x&=0\\
\end{aligned}$$
For \(ad-cb\not =0\) part, clearly we shall see that \(x=0\) as \((ad-cb)x=0\). Plugging \(x\) back to \((1)\), we get \(y=0\). Thus, two vectors are linear independent.\\
For \(ad-cb=0\) part, we need to prove that \(x(a,b)+y(c,d)=O\) has solution other than \(x=y=0\).\\
First, suppose \(a,b,c,d\not = 0\). Since \(ad-cb=0\), \(x\in \mathbb{R}\). By applying technique, we could also show \(y\in \mathbb{R}\). Thus, \((a,b),\ (c,d)\) are linear independent.\\
If \(a,b,c,d\not = 0\) does \textbf{NOT} hold. Without lose of generality (for all the possibilities, \(a,d\) and \(c.b\) are interchangeable), consider following scenarios in a \(xy\) -plane,
\begin{enumerate}
\item \(a=0,c=0\)
\label{sec:org6d6322e}

If \(a=c=0\), \(x,y\in \mathbb{R}\) in \((1)\). Because the \((2)\) is a line in the plane, there must exist some \(x,y\not = 0\).
\item \(a=0,b=0,c=0\)
\label{sec:orgdfddebd}

Same argument as above, despite the line represented by \((2)\) is a little bit peculiar (it is \(y=0\)).
\item \(a=0,d=0,c=0\)
\label{sec:org0b23b7b}

Same argument as the first, despite the line represented by \((2)\) is a little bit peculiar (it is \(x=0\)).
\item \(a=0,d=0,b=0,c=0\)
\label{sec:org0287bf6}

Both \((1), (2)\) represent the whole plane, thus, \(x,y\in \mathbb{R}\).
\end{enumerate}
\item \textbf{Exercise 5,6}
\label{sec:orgc721d1c}

To correctly understand how could functions be elements(vectors) in vector space, we need to understand that function \(f:S\rightarrow K\) is essentially a set of pairs \((s,k),\forall s\in S\). Functions have scalar multiplication and addition defined.\\
\(f+g\) is defined as \(\{(s,f(s)+g(s))|s\in S\}\), and \(cf, c\in K\) is defined as \(\{(s,c\cdot f(s))|s\in S\}\).\\
It is easy to verify that \(V\) of every \(f:S \rightarrow K\) is a vector space over \(K\). Particularly, \(O\) for \(V\) is \(\{(s,0)|s\in S\}\). So like other vector spaces, linear dependence is \textbf{about}
$$f_{sum}=\sum\limits_{i=1}^n a_if_i=O$$
Since right-hand-side of the equation is \(\{(s,0)|s\in S\}\), we can say that \(\forall v\in V, f_sum (s)=0\). This is useful in solving problems in \textbf{Exercise 5} and \textbf{Exercise 6}.\\
For example, we need to show that \(f(s)=1\) and \(g(s)=t\) are linear independent. This means that we need to consider following equation,
$$af+bg=O$$
which is an equivalent of
$$\forall t,a+bt=0$$
Above conversion is quite helpful since we could put in arbitrary \(t\) and the equation should hold. Thus, we could put in particular values of \(t\) to \textbf{construct} set of equations to show that \(a=b=0\). For example, here we plug in \(t=0\), then \(a=0\), and if we plug back \(a=0\) into original equation with \(t=0\) again, \(b=0\).\\
This method could be used throughout \textbf{Exercise 5,6}.
\item \textbf{Exercise 7}
\label{sec:org7f2c590}
\((3,5)\)
\item \textbf{Exercise 8}
\label{sec:orgc93ee50}
\emph{\textbf{Calculus involved, not doing now.}}
\item \textbf{Exercise 9}
\label{sec:orgefaac1c}
$$\begin{aligned}
\sum\limits_{i=1}^{r} [a_i\cdot (A_i\cdot \sum\limits_{j=i+1}^{r}A_{j})]&=O && \text{All vectors are mutually perpendicular}\\
&=\sum\limits_{i=1}^{r} [(a_i\cdot A_i)\cdot \sum\limits_{j=i+1}^{r}A_{j}]\\
\end{aligned}$$
Since \(\forall A\in \{A_i\}, A\not = O\), it is only possible that every \(a\) is \(0\). Thus, \({A_i}\) are linearly independent.
\item \textbf{Exercise 10}
\label{sec:org64a728f}

Since \(v,w\) are linear dependent, for
$$nv+mw=O$$
at least one of \(n,m\not =0\).
Consider following scenarios, we can see that there would be \(a=0\) or \(a=-\frac{n}{m}\).
\begin{enumerate}
\item \(n=0,m\not =0 \Rightarrow w=O\)
\label{sec:org654ac78}
\item \(n\not =0,m =0 \Rightarrow v=O\).
\label{sec:org12a2e4f}
This contradicts with \(v\not =O\) in problem. Thus, this is impossible.
\item \(n\not = 0, m\not =0 \Rightarrow w=\frac{-n}{m}v\)
\label{sec:org0d496d4}
\end{enumerate}
\end{enumerate}
\subsection{\(\S\) 3}
\label{sec:orgaa02314}
\subsubsection{Notes}
\label{sec:orgf6dc4d7}
This subsection comprises a lot of concise proofs. But in conclusion, we need to know that
$$\begin{aligned}
\text{Basis}&\Leftrightarrow \text{Maximal linear independent vector set} && \text{proof at }\bold{Theorem 3.1}\\
\text{Basis}&\Leftrightarrow \text{Maximal linear indpendent vector set} \Rightarrow \text{Generators} && \text{proof at }\bold{Theorem 2.2}\\
\text{Generators} &\nRightarrow \text{Basis} && \text{Generators are not always linear independent.}
\end{aligned}$$
Thus, all possible bases of a vector space \(V\) are of one and only one possible number of elements, which is equal to the one of maximal independent vector set.
\subsection{\(\S\) 4}
\label{sec:org97ce977}
\subsubsection{Notes}
\label{sec:org93d9da6}
\emph{Proof} for $$\dim (U\times W)=\dim U+\dim W$$
Because \(\forall u\in (U\times W) ,(O_u+O_w)+u=u+(O_u+O_w)=u\). Thus, by definition, \(O=(O_u,O_w)\).\\
Let \(A=\{u_i\}\) be a basis of \(U\) and \(B=\{w_i\}\) be a basis of \(W\). Note the dimension of \(U,W\) as \(n,m\) respectively. Let $$C=\{(u_i,0)|u_i\in A\}\cup\{(0,w_i)|w_i\in B\}$$
Since there would be no intersection between two sets being union above, the number of elements in \(C\) is \(n+m\).
If we could show that \(C\) is a basis of \(U\times W\), then we could show the original statement.\\
First we need to show that all elements in \(C\) is linear independent. This means \(a_i\in K,c_i\in C\)
$$\sum\limits_{i=1}^{n+m}a_i c_i=O$$
if and only if all the \(a_i=0\).\\
Because multiplication by scalar and addition for \(U\times W\) is defined componentwise, we shall see that (if we keep the "order" of elements in \(C\) as \(A\) and \(B\) are merged)
$$\begin{aligned}
\sum\limits_{i=1}^{n}a_i u_i&=O_u\\
\sum\limits_{i=n+1}^{n+m}a_i w_i&=O_w
\end{aligned}$$
Since both \(A\) and \(B\) are basis of \(U\) and \(W\) respectively, all the \(a_i\) should be \(0\).\\
Now, we need to show that \(C\) generates \(U\times W\). Since \(A\) and \(B\) are basis of \(U\) and \(W\) respectively,
$$\forall (a,b)\in (U\times W), \exists f_i,g_i\in K:\sum\limits_{i=1}^n f_i u_i=a \text{ and } \sum\limits_{i=1}^m g_i w_i=b $$
Thus, by setting set of scalar for "order"-kept \(C\) as \(\{f_i\}\cup \{g_i\}\), it is easy to see that it generates \(U\times W\).\\
Therefore, we see that
$$\dim (U\times W)=\dim U+\dim W$$
and
$$\{(u_i,0)|u_i\in A\}\cup\{(0,w_i)|w_i\in B\}$$
is a basis for \(U\times W\).\\
\subsubsection{Exercises}
\label{sec:org6012de4}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:org8306e20}

For the first part, we need to show that \(\forall v\in V, \exists \text{ unique } u\in U, w\in W: v=u+w\). Since \((2,1)\) and \((0,1)\) are linear independent, they are a basis of \(V=\mathbb{R}^2\). This means
$$\forall v\in V, \exists \text{ unique } a,b\in K: v=a\cdot (2,1)+b\cdot (0,1)$$
Thus, just set \(u=a\cdot (2,1)\) and \(w=b\cdot (0,1)\), and we have proved it.\\
It is same for \((2,1)\) and \((1,1)\).
\item \textbf{Exercise 2}
\label{sec:org321b8ec}

Since \((1,0,0), (1,1,0), (0,1,1)\) are linear independent, we obtain that
$$\forall v\in V, \exists \text{ unique } a,b,c\in K: v=a\cdot (1,0,0)+b\cdot (1,1,0)+ c\cdot (0,1,1)$$
Set \(u=a\cdot (1,0,0)\) and \(w=b\cdot (1,1,0)+ c\cdot (0,1,1)\), it would be proved.
\item \textbf{Exercise 3}
\label{sec:orgde35387}
$$\begin{aligned}
cA&\not =B\\
O&\not = B-cA\\
O&\not =\lambda B-c\lambda A && \lambda\not = 0\text{ (If } \lambda=0 \text{ inequality holds not)}
\end{aligned}$$
Since \(\lambda ,c\) are arbitrary and \(\lambda\not = 0\), coefficients before \(A\) and \(B\) can be anything but not equal to \(0\) together.
According to argument provided \hyperref[org9a76a6d]{here}, \(A,B\) are linear independent. Also, according to \textbf{Theorem 3.4}, they are a basis of \(\mathbb{R}^2\).\\
Based on the similar argument in \textbf{Exercise 1}, second part could be proved.
\item \textbf{Exercise 4}
\label{sec:org8187728}
See notes
\end{enumerate}
