note.org
**** *Exercise 5*
Let $C=^t(A+B)=(c_{ij})$. Then, $c_{ij}=(a_{ij}+b_{ij})'=a_{ji}+b_{ji}$. Thus, $C=^tA+^tB$.
**** *Exercise 6*
Let $B=^t(cA)$. Then, $b_{ij}=ca_{ji}$. Since $^tA=(a^{\prime}_{ij})=(a_{ji})=A$, $B=c^tA$.
**** *Exercise 7*
No difference.
**** *Exercise 8*
Skip
**** *Exercise 9*
Skip
**** *Exercise 10*
Let $B=A+^tA=(b_{ij})=(a_{ij}+a_{ji})$. Since, $b_{ij}=a_{ij}+a_{ji}=a_{ji}+b_{ij}=b_{ji}$, $B$ is symmetric.
**** *Exercise 11*
Skip
**** *Exercise 12*
Skip
**** *Exercise 13*
\\
*For followings, we mean ones in /Exercises on Dimension/ section*.\\
Followings are linear independent.
$$U_1=\begin{pmatrix}
   1 & 0 \\
   0 & 0
\end{pmatrix}$$
$$U_2=\begin{pmatrix}
   0 & 1 \\
   0 & 0
\end{pmatrix}$$
$$U_3=\begin{pmatrix}
   0 & 0 \\
   1 & 0
\end{pmatrix}$$
$$U_4=\begin{pmatrix}
   0 & 0 \\
   0 & 1
\end{pmatrix}$$
Apply $a\cdot U_1+b\cdot U_2+c\cdot U_3+d\cdot U_4=O$ to verify it.
Because it generates the matrix vector space $Mat_{2\times 2}K$ over K (For every $v\in Mat_{2\times 2}K$, simply let $a,b,c,d$ be $v$'s components) and $\{U_i\}$ are linear independent, $\{U_i\}$ is a basis of $Mat_{2\times 2}K$.\\
Because the number of elements in a basis is the dimension of the vector space, we see that the dimension of it is 4.
**** *Exercise 14*
Similar argument to *Exercise 13*. Dimension of it is $mn$.
**** *Exercise 15*
Dimension of it is $n$. Simply build up a basis to see.
**** *Exercise 16*
Similarly, dimension of it is $\frac{(n+1)n}{2}$.
**** *Exercise 17*
\\
Basis is a set comprises
$$U_1=\begin{pmatrix}
   1 & 0 \\
   0 & 0
\end{pmatrix}$$
$$U_2=\begin{pmatrix}
   0 & 1 \\
   1 & 0
\end{pmatrix}$$
$$U_3=\begin{pmatrix}
   0 & 0 \\
   0 & 1
\end{pmatrix}$$
Then, it is easy to see that dimension is 3.
**** *Exercise 18*
Basis similar to the one in *Exercise 17* is linear independent and generates space. And, indeed, the number of elements in the basis is the same as one in *Exercise 16*. Thus, dimension of it is $\frac{n(n+1)}{2}$.
**** *Exercise 19*
Same as *Exercise 15*.
**** *Exercise 20*
\\
Let $U$ be the subspace of $V$. There would be a maximal number $m$ of linear independent vectors (*Theorem 3.1* in chapter 1). Suppose the number $m> \dim V$. Then it would contradicts *Theorem 3.1* in chapter 1 as any number of vectors more than $\dim V$ would be linear dependent, which means the basis of $U$ would be linear dependent (remember $U$ is a subspace of $V$). Thus, $m\leq \dim V$.\\
Dimension could be $0,1,2$.
**** *Exercise 21*
\\
According to the lemma we proved in *Exercise 20*, dimension of subspace of $\mathbb{R}^{3}$ could be $0,1,2,3$.
** $\S$ 2
*** Notes
*Lemma* Let $A$ be a set of linear dependent vectors that generates $V$. Then, for all $v\in V$, there exists infinite linear combinations of $A$ that form $v$.\\
/Proof/ Say that number of vectors in $A$ is $n$. Since $A$ generates $V$, $\forall v\in V, \exists \{a_i\}: v=\sum\limits_{i=1}^n a_i A_i$. Let $L$ be a set of linear combinations that form $v$ (here $L$ is a set of sets). We have
$$\begin{aligned}
v&=\sum\limits_{i=1}^n a_iA_i+O\\
&=\sum\limits_{i=1}^n a_iA_i+\sum\limits_{i=1}^n b_iA_i\\
&=\sum\limits_{i=1}^n (a_i+b_i) A_i
\end{aligned}$$
Since $A$ is linear dependent, there exists $\{b_i\}$ where not every element is $0$. Therefore, $\{a_i+b_i\}\in L$ and $\{a_i+b_i\}\not = \{a_i\}$ for some $\{b_i\}$.\\
This means that $\forall \ell \in L$, we can always form a new $\ell^{\prime}\in L$. And since for all $v\in V$ we always have one linear combination, we can do it infinitely, which means number of elements in $L$ is infinite. Therefore, we have shown what was to be shown. $\blacksquare$ \\
Here we discuss the number of solutions for general linear equations. ($A$ is a $m\times n$ matrix. $X$ is a $n\times 1$ column matrix. $B$ is a $m\times 1$ column matrix).
$$AX=B$$
If $n>m$, according to *Theorem 3.1 in chapter 1*, they must be linear dependent, resulting in infinite number of solutions because of *Lemma* above.\\
If $n=m$ and they are linear independent (it is then a basis because they are maximal independent vectors), there would only be one solution as *Theorem 2.1 in chapter 1* stated. If they are linear dependent and $B$ is in the subspace generated by column vectors of $A$, there would be infinite number of solutions (*Lemma*), else the equations are not solvable (there exists no linear combination to represent $B$).\\
If $n<m$ and they are independent and $B$ is in the subspace generated by column vectors of $A$, there would be only one solution. If they are linear independent but $B$ is not in subspace, then it is unsolvable. If they are linear dependent and $B$ is in subspace, infinite solutions occur. If they are linear dependent but $B$ is not in subspace, equations are not solvable.\\
In general,
***** If $B$ is in the vector space generated by column vectors of $A$ and they are linear independent, there exists one unique solution.
***** If $B$ is in the vector space generated by column vectors of $A$ and they are linear dependent, there exists infinite solutions.
***** If $B$ is not in the vector space generated by column vectors of $A$, there would be no solution.
*** Exercises
**** *Exercise 1*
See notes and refer to the definition of linear independence.
**** *Exercise 2*
\\
Let $u$ be one set of solution and $w$ be another.\\
We want to show that $u+w\in X$.
$$\sum\limits_{i=1}^n (u_i+w_i)\cdot A^i=\sum\limits_{i=1}^n u_i\cdot A^i+\sum\limits_{i=1}^n w_i\cdot A^i=O+O=O$$
Thus, $u+w\in X$.
Also, we need to show $cu\in X$ where $c\in K$.
$$c \sum\limits_{i=1}^n u_i \cdot A^i=cO=O$$
Other *VS* s are easy to follow as we define the addition of vectors in $X$ componentwise, $O$ as a vector whose components are all zero, $1$ as a vector whose components are all one.
**** *Exercise 3*
We want to show following
$$\begin{aligned}
\sum\limits_{i=1}^n (a_i+b_i \text{i}) A^i&=O_{\mathbb{C}}\\
\sum\limits_{i=1}^n a_iA^{i}+\sum\limits_{i=1}^n b_i \text{i} \cdot A^i &= O_{\mathbb{C}}\\
O_{\mathbb{C}}+\sum\limits_{i=1}^n b_i \text{i} \cdot A^i&=O_{\mathbb{C}}\\
\sum\limits_{i=1}^n b_i \cdot A^i&=O_{\mathbb{C}}
\end{aligned}$$
This means that $\{A^i\}$ should be linear independent over $\mathbb{R}$ ($\sum\limits_{i=1}^n b_i \cdot A^i=O_{\mathbb{C}}$ is equal to $\sum\limits_{i=1}^n b_i \cdot A^i=O_{\mathbb{R}}$ as there is no imaginary part). Since it is known to us that $\{A^i\}$ is linear independent over $\mathbb{R}$, it has been proved as we do it reversely.
**** *Exercise 4*
We know that
$$\sum\limits_{i=1}^n (a_i+b_i \text{i}) A^i = O_{\mathbb{C}}$$
which means that $\sum\limits_{i=1}^n a_i A^i = O_{\mathbb{C}}$ and/or $\sum\limits_{i=1}^n b_i A^i = O_{\mathbb{C}}$.
For either cases, we have shown it is linear dependent over $\mathbb{R}$ ($a_i,b_i\in \mathbb{R}$).
** $\S$ 3
*** Exercises
**** *Exercise 1*
$AI=IA=A$
**** *Exercise 2*
$AO=O$
**** *Exercise 3*
\\
For every $A$ and $B$, $(AB)C=A(BC)$.
