note.tex
\section{Chapter 2}
\label{sec:org02075a1}
\subsection{\(\S\) 1}
\label{sec:org31e9cf1}
\subsubsection{Exercises}
\label{sec:org36d5368}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:orgb41cb92}
Skip
\item \textbf{Exercise 2}
\label{sec:org6e8912a}
Skip
\item \textbf{Exercise 3}
\label{sec:org4ea8200}
Skip
\item \textbf{Exercise 4}
\label{sec:orgc75a75e}
Skip
\item \textbf{Exercise 5}
\label{sec:orgbadd659}
Let \(C=^t(A+B)=(c_{ij})\). Then, \(c_{ij}=(a_{ij}+b_{ij})'=a_{ji}+b_{ji}\). Thus, \(C=^tA+^tB\).
\item \textbf{Exercise 6}
\label{sec:org998902d}
Let \(B=^t(cA)\). Then, \(b_{ij}=ca_{ji}\). Since \(^tA=(a^{\prime}_{ij})=(a_{ji})=A\), \(B=c^tA\).
\item \textbf{Exercise 7}
\label{sec:org47034df}
No difference.
\item \textbf{Exercise 8}
\label{sec:org66f916e}
Skip
\item \textbf{Exercise 9}
\label{sec:org40f4899}
Skip
\item \textbf{Exercise 10}
\label{sec:org6210b67}
Let \(B=A+^tA=(b_{ij})=(a_{ij}+a_{ji})\). Since, \(b_{ij}=a_{ij}+a_{ji}=a_{ji}+b_{ij}=b_{ji}\), \(B\) is symmetric.
\item \textbf{Exercise 11}
\label{sec:org277ed05}
Skip
\item \textbf{Exercise 12}
\label{sec:org6c8745e}
Skip
\item \textbf{Exercise 13}
\label{sec:org9fb71b7}

\textbf{For followings, we mean ones in \emph{Exercises on Dimension} section}.\\
Followings are linear independent.
$$U_1=\begin{pmatrix}
   1 & 0 \\
   0 & 0
\end{pmatrix}$$
$$U_2=\begin{pmatrix}
   0 & 1 \\
   0 & 0
\end{pmatrix}$$
$$U_3=\begin{pmatrix}
   0 & 0 \\
   1 & 0
\end{pmatrix}$$
$$U_4=\begin{pmatrix}
   0 & 0 \\
   0 & 1
\end{pmatrix}$$
Apply \(a\cdot U_1+b\cdot U_2+c\cdot U_3+d\cdot U_4=O\) to verify it.
Because it generates the matrix vector space \(Mat_{2\times 2}K\) over K (For every \(v\in Mat_{2\times 2}K\), simply let \(a,b,c,d\) be \(v\)'s components) and \(\{U_i\}\) are linear independent, \(\{U_i\}\) is a basis of \(Mat_{2\times 2}K\).\\
Because the number of elements in a basis is the dimension of the vector space, we see that the dimension of it is 4.
\item \textbf{Exercise 14}
\label{sec:org65eed05}
Similar argument to \textbf{Exercise 13}. Dimension of it is \(mn\).
\item \textbf{Exercise 15}
\label{sec:org09f3105}
Dimension of it is \(n\). Simply build up a basis to see.
\item \textbf{Exercise 16}
\label{sec:org2060a09}
Similarly, dimension of it is \(\frac{(n+1)n}{2}\).
\item \textbf{Exercise 17}
\label{sec:org81efe86}

Basis is a set comprises
$$U_1=\begin{pmatrix}
   1 & 0 \\
   0 & 0
\end{pmatrix}$$
$$U_2=\begin{pmatrix}
   0 & 1 \\
   1 & 0
\end{pmatrix}$$
$$U_3=\begin{pmatrix}
   0 & 0 \\
   0 & 1
\end{pmatrix}$$
Then, it is easy to see that dimension is 3.
\item \textbf{Exercise 18}
\label{sec:org5a375f5}
Basis similar to the one in \textbf{Exercise 17} is linear independent and generates space. And, indeed, the number of elements in the basis is the same as one in \textbf{Exercise 16}. Thus, dimension of it is \(\frac{n(n+1)}{2}\).
\item \textbf{Exercise 19}
\label{sec:orgb1f1e7a}
Same as \textbf{Exercise 15}.
\item \textbf{Exercise 20}
\label{sec:org8a79ef8}

Let \(U\) be the subspace of \(V\). There would be a maximal number \(m\) of linear independent vectors (\textbf{Theorem 3.1} in chapter 1). Suppose the number \(m> \dim V\). Then it would contradicts \textbf{Theorem 3.1} in chapter 1 as any number of vectors more than \(\dim V\) would be linear dependent, which means the basis of \(U\) would be linear dependent (remember \(U\) is a subspace of \(V\)). Thus, \(m\leq \dim V\).\\
Dimension could be \(0,1,2\).
\item \textbf{Exercise 21}
\label{sec:org2f139f0}

According to the lemma we proved in \textbf{Exercise 20}, dimension of subspace of \(\mathbb{R}^{3}\) could be \(0,1,2,3\).
\end{enumerate}
\subsection{\(\S\) 2}
\label{sec:orgdae8277}
\subsubsection{Notes}
\label{sec:org88e251a}
\textbf{Lemma} Let \(A\) be a set of linear dependent vectors that generates \(V\). Then, for all \(v\in V\), there exists infinite linear combinations of \(A\) that form \(v\).\\
\emph{Proof} Say that number of vectors in \(A\) is \(n\). Since \(A\) generates \(V\), \(\forall v\in V, \exists \{a_i\}: v=\sum\limits_{i=1}^n a_i A_i\). Let \(L\) be a set of linear combinations that form \(v\) (here \(L\) is a set of sets). We have
$$\begin{aligned}
v&=\sum\limits_{i=1}^n a_iA_i+O\\
&=\sum\limits_{i=1}^n a_iA_i+\sum\limits_{i=1}^n b_iA_i\\
&=\sum\limits_{i=1}^n (a_i+b_i) A_i
\end{aligned}$$
Since \(A\) is linear dependent, there exists \(\{b_i\}\) where not every element is \(0\). Therefore, \(\{a_i+b_i\}\in L\) and \(\{a_i+b_i\}\not = \{a_i\}\) for some \(\{b_i\}\).\\
This means that \(\forall \ell \in L\), we can always form a new \(\ell^{\prime}\in L\). And since for all \(v\in V\) we always have one linear combination, we can do it infinitely, which means number of elements in \(L\) is infinite. Therefore, we have shown what was to be shown. \(\blacksquare\) \\
Here we discuss the number of solutions for general linear equations. (\(A\) is a \(m\times n\) matrix. \(X\) is a \(n\times 1\) column matrix. \(B\) is a \(m\times 1\) column matrix).
$$AX=B$$
If \(n>m\), according to \textbf{Theorem 3.1 in chapter 1}, they must be linear dependent, resulting in infinite number of solutions because of \textbf{Lemma} above.\\
If \(n=m\) and they are linear independent (it is then a basis because they are maximal independent vectors), there would only be one solution as \textbf{Theorem 2.1 in chapter 1} stated. If they are linear dependent and \(B\) is in the subspace generated by column vectors of \(A\), there would be infinite number of solutions (\textbf{Lemma}), else the equations are not solvable (there exists no linear combination to represent \(B\)).\\
If \(n<m\) and they are independent and \(B\) is in the subspace generated by column vectors of \(A\), there would be only one solution. If they are linear independent but \(B\) is not in subspace, then it is unsolvable. If they are linear dependent and \(B\) is in subspace, infinite solutions occur. If they are linear dependent but \(B\) is not in subspace, equations are not solvable.\\
In general,
\begin{enumerate}
\item If \(B\) is in the vector space generated by column vectors of \(A\) and they are linear independent, there exists one unique solution.
\label{sec:org23da5ec}
\item If \(B\) is in the vector space generated by column vectors of \(A\) and they are linear dependent, there exists infinite solutions.
\label{sec:orgca8f983}
\item If \(B\) is not in the vector space generated by column vectors of \(A\), there would be no solution.
\label{sec:org821b51d}
\end{enumerate}
\subsubsection{Exercises}
\label{sec:org9690a44}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:orgb055862}
See notes and refer to the definition of linear independence.
\item \textbf{Exercise 2}
\label{sec:org2f06e5e}

Let \(u\) be one set of solution and \(w\) be another.\\
We want to show that \(u+w\in X\).
$$\sum\limits_{i=1}^n (u_i+w_i)\cdot A^i=\sum\limits_{i=1}^n u_i\cdot A^i+\sum\limits_{i=1}^n w_i\cdot A^i=O+O=O$$
Thus, \(u+w\in X\).
Also, we need to show \(cu\in X\) where \(c\in K\).
$$c \sum\limits_{i=1}^n u_i \cdot A^i=cO=O$$
Other \textbf{VS} s are easy to follow as we define the addition of vectors in \(X\) componentwise, \(O\) as a vector whose components are all zero, \(1\) as a vector whose components are all one.
\item \textbf{Exercise 3}
\label{sec:org1c129dc}
We want to show following
$$\begin{aligned}
\sum\limits_{i=1}^n (a_i+b_i \text{i}) A^i&=O_{\mathbb{C}}\\
\sum\limits_{i=1}^n a_iA^{i}+\sum\limits_{i=1}^n b_i \text{i} \cdot A^i &= O_{\mathbb{C}}\\
O_{\mathbb{C}}+\sum\limits_{i=1}^n b_i \text{i} \cdot A^i&=O_{\mathbb{C}}\\
\sum\limits_{i=1}^n b_i \cdot A^i&=O_{\mathbb{C}}
\end{aligned}$$
This means that \(\{A^i\}\) should be linear independent over \(\mathbb{R}\) (\(\sum\limits_{i=1}^n b_i \cdot A^i=O_{\mathbb{C}}\) is equal to \(\sum\limits_{i=1}^n b_i \cdot A^i=O_{\mathbb{R}}\) as there is no imaginary part). Since it is known to us that \(\{A^i\}\) is linear independent over \(\mathbb{R}\), it has been proved as we do it reversely.
\item \textbf{Exercise 4}
\label{sec:org87318de}
We know that
$$\sum\limits_{i=1}^n (a_i+b_i \text{i}) A^i = O_{\mathbb{C}}$$
which means that \(\sum\limits_{i=1}^n a_i A^i = O_{\mathbb{C}}\) and/or \(\sum\limits_{i=1}^n b_i A^i = O_{\mathbb{C}}\).
For either cases, we have shown it is linear dependent over \(\mathbb{R}\) (\(a_i,b_i\in \mathbb{R}\)).
\end{enumerate}
\subsection{\(\S\) 3}
\label{sec:orgf58f030}
\subsubsection{Exercises}
\label{sec:orgda99633}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:org70713db}
\(AI=IA=A\)
\item \textbf{Exercise 2}
\label{sec:org20a484d}
\(AO=O\)
\item \textbf{Exercise 3}
\label{sec:org9c832dd}

For every \(A\) and \(B\), \((AB)C=A(BC)\).
\begin{enumerate}
\item Case 1
\label{sec:org35d6828}
$$\begin{pmatrix}
3&2\\
4&1
\end{pmatrix}$$
\item Case 2
\label{sec:org2fbf745}
$$\begin{pmatrix}
10\\
14
\end{pmatrix}$$
\item Case 3
\label{sec:org898c8c2}
$$\begin{pmatrix}
33&37\\
11&-18
\end{pmatrix}$$
\end{enumerate}
\item \textbf{Exercise 4}
\label{sec:org02a35f4}
