note.org
***** Case 1
$$\begin{pmatrix}
3&2\\
4&1
\end{pmatrix}$$
***** Case 2
$$\begin{pmatrix}
10\\
14
\end{pmatrix}$$
***** Case 3
$$\begin{pmatrix}
33&37\\
11&-18
\end{pmatrix}$$
**** *Exercise 4*
This one could be proved as it is proved [[(a+b)^2][here]].
**** *Exercise 5*
$$AB=\begin{pmatrix}
4&2\\
5&-1
\end{pmatrix}$$
$$BA=\begin{pmatrix}
2&4\\
4&1
\end{pmatrix}$$
**** *Exercise 6*
$$CA=AC=\begin{pmatrix}
7&14\\
21&-7
\end{pmatrix}$$
$$CB=BC=\begin{pmatrix}
14&0\\
7&7
\end{pmatrix}$$
General rule is that for symmetric one, we may have $AB=BA$? (I am not sure here).
**** *Exercise 7*
$$XA=\begin{pmatrix}
3&1&5
\end{pmatrix}$$
**** *Exercise 8*
$$\begin{aligned}
X_1 A=A_2\\
X_2 A=A_3
\end{aligned}$$
Let $X_i$ be a unit vector with only $i$ -th component equal to $1$. $X_i A=A_i$
**** *Exercise 9*
\\
Skip the steps involving verifications.
$^t (AB)=^tB^tA$ has already been proved in $\S2$. Thus, $^t [(AB)C]=^t C\cdot ^t (AB)=^t C\cdot ^t B\cdot ^tA$.
**** *Exercise 10*
\\
Firstly, we know $A$ is of $1\times n$, $M$ is of $n\times n$ and $B$ is of $1\times n$. This means that $\dim (\langle A,B\rangle)=1$. Also, it implies that $^t (\langle A,B\rangle)=\langle A,B\rangle$. Thus, we have
$$\begin{aligned}
\langle A,B\rangle&=^t (\langle A,B\rangle)\\
&=^t(AM^tB)\\
&=^t(^tB)\cdot ^tM\cdot ^tA && \text{Exercise 9}\\
&=BM^tA\\
&=\langle B,A\rangle
\end{aligned}$$
which is *SP 1*.
Also, let
$$N=^t(B+C)$$
Then, $n_{ij}=n^{\prime}_{ji}=b_{ji}+c_{ji}$. This implies also $N=^tA+^tB$. Therefore,
$$\langle A,B+C\rangle=AM^t(B+C)=AM(^tB+^tC)=\langle A,B\rangle+\langle A,C\rangle$$
which is *SP 2*. Finally
$$\langle cA,B\rangle=cAM^tB=c\langle A,B\rangle$$
which is *SP 3*.
**** *Exercise 11*
\\
For part *(a)*, see *Exercise 35*.\\
Part *(b)*
$$A^2=\begin{pmatrix}
1&2&3\\
0&1&2\\
0&0&1
\end{pmatrix}$$
$$A^3=\begin{pmatrix}
1&3&6\\
0&1&3\\
0&0&1
\end{pmatrix}$$
$$A^4=\begin{pmatrix}
1&4&10\\
0&1&4\\
0&0&1
\end{pmatrix}$$
**** *Exercise 12*
$$(AX)_{a}=\begin{pmatrix}
4\\
7\\
5
\end{pmatrix}
(AX)_{b}=\begin{pmatrix}
3\\
1
\end{pmatrix}$$
$$(AX)_c=\begin{pmatrix}
x_2\\
0
\end{pmatrix}
(AX)_d=\begin{pmatrix}
0\\
x_1
\end{pmatrix}$$
**** *Exercise 13*
$$(AX)_a=\begin{pmatrix}
2\\
4
\end{pmatrix}$$
$$(AX)_b=\begin{pmatrix}
4\\
6
\end{pmatrix}$$
$$(AX)_c=\begin{pmatrix}
3\\
5
\end{pmatrix}$$
**** *Exercise 14*
$$(AX)_a=\begin{pmatrix}
3\\
1\\
2
\end{pmatrix}$$
$$(AX)_b=\begin{pmatrix}
12\\
3\\
9
\end{pmatrix}$$
$$(AX)_c=\begin{pmatrix}
5\\
4\\
8
\end{pmatrix}$$
**** *Exercise 15*
$AX=A^2$ (second column of $A$).
**** *Exercise 16*
$AX=A^i$
**** *Exercise 17*
\\
Let $U_i$ be a unit column vector which only has $1$ on its $i$ -th component. The proposed form of $C^k$ could be written in the following way.
$$\begin{aligned}
C^k&=\sum\limits_{i=1}^n b_{ik}A^i\\
&=\sum\limits_{i=1}^n b_{ik}[\sum\limits_{j=1}^m (a_{ji}\cdot U_j)]\\
&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^m a_{ji}b_{ik}\cdot U_j]\\
\end{aligned}$$
$$\begin{aligned}
C^k&=\sum\limits_{j=1}^m A_j\cdot B^k\cdot U_j\\
&=\sum\limits_{j=1}^m [\sum\limits_{i=1}^n a_{ji}b_{ik}\cdot U_j]
\end{aligned}$$
Two forms are essentially the same if you expand them and compare. Thus, we have proved that the proposed formula is an equivalence of the original definition.
**** *Exercise 18*
***** $A^{-1}=(I+A)\Rightarrow A\cdot A^{-1}=I^2-A^2=I$
***** $A^{-1}=(I^2+IA+A^2)\Rightarrow A\cdot A^{-1}=I^3-A^3=I$
***** For real number $I$ and $A$, we see that $I^n-A^n$ can be factored into $I-A$ and another polynomial, because according to remainder theorem, plugging in $I=A$ results in $I^n-A^n=0$. Thus, we could follow the same pattern to construct always a $A^{-1}$.
***** Set $A^{-1}=(-A-2I)$
***** Set $A^{-1}=(-A^2-A)$
**** *Exercise 19*
$$AB=\begin{pmatrix}
1 & ab\\
0 & 1
\end{pmatrix}$$
$$A^2=\begin{pmatrix}
1 & 2a\\
0 & 1
\end{pmatrix}$$
Inductive step:
$$\begin{aligned}
A^{n+1}&=A^n\cdot A\\
&=\begin{pmatrix}
1 & na\\
0 & 1
\end{pmatrix}\cdot A\\
&=\begin{pmatrix}
1 & (n+1)a\\
0 & 1
\end{pmatrix}
\end{aligned}$$
Thus, we have proved it.
**** *Exercise 20*
$$A^{-1}=\begin{pmatrix}
1 & -a \\
0 & 1
\end{pmatrix}$$
**** *Exercise 21*
We now show that $B^{-1}A^{-1}$ would be an inverse of $AB$.
$$(AB)(B^{-1}A^{-1})=A(B\cdot B^{-1})A^{-1}=A\cdot A^{-1}=I$$
And for the reverse, it is easy to verify either.
**** *Exercise 22*
See the solution manual
**** *Exercise 23*
$$\begin{aligned}
A^2&=A\cdot A\\
&=\begin{pmatrix}
\cos 2\theta & -\sin 2\theta\\
\sin 2\theta & \cos 2\theta
\end{pmatrix}
\end{aligned}$$
Inductive step:
$$\begin{aligned}
A^{n+1}&=\begin{pmatrix}
\cos n\theta & -\sin n\theta\\
\sin n\theta & \cos n\theta
\end{pmatrix}\cdot A\\
&=\begin{pmatrix}
\cos n\theta \cos \theta - \sin n\theta \sin \theta & -(\sin n\theta \cos \theta + \sin \theta \cos n\theta) \\
\sin n\theta \cos \theta + \sin \theta \cos n\theta & - \sin n\theta + \cos n\theta \cos \theta
\end{pmatrix}\\
&=\begin{pmatrix}
\cos (n+1)\theta & -\sin (n+1)\theta\\
\sin (n+1)\theta & \cos (n+1)\theta
\end{pmatrix}
\end{aligned}$$
Thus, we have determined $A^n$
**** *Exercise 24*
$$A=\begin{pmatrix}
0 & 1\\
-1 & 0
\end{pmatrix}$$
**** *Exercise 25*
***** $\text{tr}(A)=2$
***** $\text{tr}(A)=4$
***** $\text{tr}(A)=8$
**** *Exercise 26*
See *Exercise 27*.
**** *Exercise 27*
$$\begin{aligned}
\text{tr}(AB)&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^n a_{ij} b_{ji}]\\
&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^n b_{ji} a_{ij}]\\
&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^n b_{ij} a_{ji}] && \text{They are the same if you expand}\\
&=\text{tr}(BA)
\end{aligned}$$
**** *Exercise 28*
As diagonal line keeps same after transpose, trace of the matrix would not change as well.
**** *Exercise 29*
$A^n=((a_{ij})^n)$
**** *Exercise 30*
$$A^2=\begin{pmatrix}
a_1^2 & 0 & \cdots & 0\\
0 & a_2^2 & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & a_n^2
\end{pmatrix}$$
Inductive step
$$A^{k+1}=\begin{pmatrix}
a_1^k & 0 & \cdots & 0\\
0 & a_2^k & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & a_n^k
\end{pmatrix}\cdot A=\begin{pmatrix}
a_1^{k+1} & 0 & \cdots & 0\\
0 & a_2^{k+1} & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & a_n^{k+1}
\end{pmatrix}$$
$\blacksquare$
**** *Exercise 31*
See *Exercise 35*
**** *Exercise 32*
We want to show
$$\begin{aligned}
^t(A^{-1})&=(^t A)^{-1}\\
^t(A^{-1})\cdot ^t (A)&=(^t A)^{-1} \cdot (^tA)\\
^t(A^{-1})\cdot ^t (A)&=I_n\\
\end{aligned}$$
Let $C=^t(A^{-1})\cdot ^t (A)$. We then know
$$\begin{aligned}
c_{ij}&=\sum\limits_{k=1}^n a^{\prime -1}_{ik} a^{\prime}_{kj}\\
&=\sum\limits_{k=1}^n a_{jk} a^{-1}_{ki}\\
&=A_j\cdot A^{-1\ i}
\end{aligned}$$
Thus,
$$\begin{aligned}
C&=^t(A\cdot A^{-1})\\
&=^t(I_n)=I_n
\end{aligned}$$
If we do it in the reverse way, then we can prove it.
**** *Exercise 33*
Let $B=^t (\bar{A})$, then $b_{ij}=\bar{a}_{ji}$. Let $C=\overline{^t A}$, then $c_{ij}=\bar{a^{\prime}}_{ij}=\bar{a}_{ji}$. Thus, $B=C$.
**** *Exercise 34*
Its inverse is
$$\begin{pmatrix}
\frac{1}{a_1} & 0 & \cdots & 0\\
0 & \frac{1}{a_2} & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & \frac{1}{a_n}
\end{pmatrix}$$
**** *Exercise 35*
See solution manual. Here I would not like to introduce complex formal reasoning to simulate computation result.
