note.tex
This one could be proved as it is proved \hyperref[org5da29d8]{here}.
\item \textbf{Exercise 5}
\label{sec:orge2f86c9}
$$AB=\begin{pmatrix}
4&2\\
5&-1
\end{pmatrix}$$
$$BA=\begin{pmatrix}
2&4\\
4&1
\end{pmatrix}$$
\item \textbf{Exercise 6}
\label{sec:orge193ad3}
$$CA=AC=\begin{pmatrix}
7&14\\
21&-7
\end{pmatrix}$$
$$CB=BC=\begin{pmatrix}
14&0\\
7&7
\end{pmatrix}$$
General rule is that for symmetric one, we may have \(AB=BA\)? (I am not sure here).
\item \textbf{Exercise 7}
\label{sec:org3b4d5ad}
$$XA=\begin{pmatrix}
3&1&5
\end{pmatrix}$$
\item \textbf{Exercise 8}
\label{sec:orgaf50b2c}
$$\begin{aligned}
X_1 A=A_2\\
X_2 A=A_3
\end{aligned}$$
Let \(X_i\) be a unit vector with only \(i\) -th component equal to \(1\). \(X_i A=A_i\)
\item \textbf{Exercise 9}
\label{sec:org2c200f4}

Skip the steps involving verifications.
\(^t (AB)=^tB^tA\) has already been proved in \(\S2\). Thus, \(^t [(AB)C]=^t C\cdot ^t (AB)=^t C\cdot ^t B\cdot ^tA\).
\item \textbf{Exercise 10}
\label{sec:org063295c}

Firstly, we know \(A\) is of \(1\times n\), \(M\) is of \(n\times n\) and \(B\) is of \(1\times n\). This means that \(\dim (\langle A,B\rangle)=1\). Also, it implies that \(^t (\langle A,B\rangle)=\langle A,B\rangle\). Thus, we have
$$\begin{aligned}
\langle A,B\rangle&=^t (\langle A,B\rangle)\\
&=^t(AM^tB)\\
&=^t(^tB)\cdot ^tM\cdot ^tA && \text{Exercise 9}\\
&=BM^tA\\
&=\langle B,A\rangle
\end{aligned}$$
which is \textbf{SP 1}.
Also, let
$$N=^t(B+C)$$
Then, \(n_{ij}=n^{\prime}_{ji}=b_{ji}+c_{ji}\). This implies also \(N=^tA+^tB\). Therefore,
$$\langle A,B+C\rangle=AM^t(B+C)=AM(^tB+^tC)=\langle A,B\rangle+\langle A,C\rangle$$
which is \textbf{SP 2}. Finally
$$\langle cA,B\rangle=cAM^tB=c\langle A,B\rangle$$
which is \textbf{SP 3}.
\item \textbf{Exercise 11}
\label{sec:orgb73eba9}

For part \textbf{(a)}, see \textbf{Exercise 35}.\\
Part \textbf{(b)}
$$A^2=\begin{pmatrix}
1&2&3\\
0&1&2\\
0&0&1
\end{pmatrix}$$
$$A^3=\begin{pmatrix}
1&3&6\\
0&1&3\\
0&0&1
\end{pmatrix}$$
$$A^4=\begin{pmatrix}
1&4&10\\
0&1&4\\
0&0&1
\end{pmatrix}$$
\item \textbf{Exercise 12}
\label{sec:orgeabc5e2}
$$(AX)_{a}=\begin{pmatrix}
4\\
7\\
5
\end{pmatrix}
(AX)_{b}=\begin{pmatrix}
3\\
1
\end{pmatrix}$$
$$(AX)_c=\begin{pmatrix}
x_2\\
0
\end{pmatrix}
(AX)_d=\begin{pmatrix}
0\\
x_1
\end{pmatrix}$$
\item \textbf{Exercise 13}
\label{sec:orgc125bdf}
$$(AX)_a=\begin{pmatrix}
2\\
4
\end{pmatrix}$$
$$(AX)_b=\begin{pmatrix}
4\\
6
\end{pmatrix}$$
$$(AX)_c=\begin{pmatrix}
3\\
5
\end{pmatrix}$$
\item \textbf{Exercise 14}
\label{sec:orgb7d72c0}
$$(AX)_a=\begin{pmatrix}
3\\
1\\
2
\end{pmatrix}$$
$$(AX)_b=\begin{pmatrix}
12\\
3\\
9
\end{pmatrix}$$
$$(AX)_c=\begin{pmatrix}
5\\
4\\
8
\end{pmatrix}$$
\item \textbf{Exercise 15}
\label{sec:org54a680d}
\(AX=A^2\) (second column of \(A\)).
\item \textbf{Exercise 16}
\label{sec:orgfbb3167}
\(AX=A^i\)
\item \textbf{Exercise 17}
\label{sec:org819f718}

Let \(U_i\) be a unit column vector which only has \(1\) on its \(i\) -th component. The proposed form of \(C^k\) could be written in the following way.
$$\begin{aligned}
C^k&=\sum\limits_{i=1}^n b_{ik}A^i\\
&=\sum\limits_{i=1}^n b_{ik}[\sum\limits_{j=1}^m (a_{ji}\cdot U_j)]\\
&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^m a_{ji}b_{ik}\cdot U_j]\\
\end{aligned}$$
$$\begin{aligned}
C^k&=\sum\limits_{j=1}^m A_j\cdot B^k\cdot U_j\\
&=\sum\limits_{j=1}^m [\sum\limits_{i=1}^n a_{ji}b_{ik}\cdot U_j]
\end{aligned}$$
Two forms are essentially the same if you expand them and compare. Thus, we have proved that the proposed formula is an equivalence of the original definition.
\item \textbf{Exercise 18}
\label{sec:org77a58a0}
\begin{enumerate}
\item \(A^{-1}=(I+A)\Rightarrow A\cdot A^{-1}=I^2-A^2=I\)
\label{sec:org4230635}
\item \(A^{-1}=(I^2+IA+A^2)\Rightarrow A\cdot A^{-1}=I^3-A^3=I\)
\label{sec:orgca0c4f0}
\item For real number \(I\) and \(A\), we see that \(I^n-A^n\) can be factored into \(I-A\) and another polynomial, because according to remainder theorem, plugging in \(I=A\) results in \(I^n-A^n=0\). Thus, we could follow the same pattern to construct always a \(A^{-1}\).
\label{sec:orge61a4e4}
\item Set \(A^{-1}=(-A-2I)\)
\label{sec:orgd95587d}
\item Set \(A^{-1}=(-A^2-A)\)
\label{sec:orgf115128}
\end{enumerate}
\item \textbf{Exercise 19}
\label{sec:org85a5935}
$$AB=\begin{pmatrix}
1 & ab\\
0 & 1
\end{pmatrix}$$
$$A^2=\begin{pmatrix}
1 & 2a\\
0 & 1
\end{pmatrix}$$
Inductive step:
$$\begin{aligned}
A^{n+1}&=A^n\cdot A\\
&=\begin{pmatrix}
1 & na\\
0 & 1
\end{pmatrix}\cdot A\\
&=\begin{pmatrix}
1 & (n+1)a\\
0 & 1
\end{pmatrix}
\end{aligned}$$
Thus, we have proved it.
\item \textbf{Exercise 20}
\label{sec:orgc94c06d}
$$A^{-1}=\begin{pmatrix}
1 & -a \\
0 & 1
\end{pmatrix}$$
\item \textbf{Exercise 21}
\label{sec:org69bf253}
We now show that \(B^{-1}A^{-1}\) would be an inverse of \(AB\).
$$(AB)(B^{-1}A^{-1})=A(B\cdot B^{-1})A^{-1}=A\cdot A^{-1}=I$$
And for the reverse, it is easy to verify either.
\item \textbf{Exercise 22}
\label{sec:org71d0ca0}
See the solution manual
\item \textbf{Exercise 23}
\label{sec:org78d3ec5}
$$\begin{aligned}
A^2&=A\cdot A\\
&=\begin{pmatrix}
\cos 2\theta & -\sin 2\theta\\
\sin 2\theta & \cos 2\theta
\end{pmatrix}
\end{aligned}$$
Inductive step:
$$\begin{aligned}
A^{n+1}&=\begin{pmatrix}
\cos n\theta & -\sin n\theta\\
\sin n\theta & \cos n\theta
\end{pmatrix}\cdot A\\
&=\begin{pmatrix}
\cos n\theta \cos \theta - \sin n\theta \sin \theta & -(\sin n\theta \cos \theta + \sin \theta \cos n\theta) \\
\sin n\theta \cos \theta + \sin \theta \cos n\theta & - \sin n\theta + \cos n\theta \cos \theta
\end{pmatrix}
&=\begin{pmatrix}
\cos (n+1)\theta & -\sin (n+1)\theta\\
\sin (n+1)\theta & \cos (n+1)\theta
\end{pmatrix}
\end{aligned}$$
Thus, we have determined \(A^n\)
\item \textbf{Exercise 24}
\label{sec:orgddb69e9}
$$A=\begin{pmatrix}
0 & 1\\
-1 & 0
\end{pmatrix}$$
\item \textbf{Exercise 25}
\label{sec:orgaeb6cfe}
\begin{enumerate}
\item \(\text{tr}(A)=2\)
\label{sec:orgd55c6a2}
\item \(\text{tr}(A)=4\)
\label{sec:org480ebb4}
\item \(\text{tr}(A)=8\)
\label{sec:org478af36}
\end{enumerate}
\item \textbf{Exercise 26}
\label{sec:org57e3858}
See \textbf{Exercise 27}.
\item \textbf{Exercise 27}
\label{sec:orgcb1b465}
$$\begin{aligned}
\text{tr}(AB)&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^n a_{ij} b_{ji}]\\
&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^n b_{ji} a_{ij}]\\
&=\sum\limits_{i=1}^n [\sum\limits_{j=1}^n b_{ij} a_{ji}] && \text{They are the same if you expand}\\
&=\text{tr}(BA)
\end{aligned}$$
\item \textbf{Exercise 28}
\label{sec:org786a3cf}
As diagonal line keeps same after transpose, trace of the matrix would not change as well.
\item \textbf{Exercise 29}
\label{sec:orgd44da63}
\(A^n=((a_{ij})^n)\)
\item \textbf{Exercise 30}
\label{sec:org02f3a08}
$$A^2=\begin{pmatrix}
a_1^2 & 0 & \cdots & 0\\
0 & a_2^2 & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & a_n^2
\end{pmatrix}$$
Inductive step
$$A^{k+1}=\begin{pmatrix}
a_1^k & 0 & \cdots & 0\\
0 & a_2^k & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & a_n^k
\end{pmatrix}\cdot A=\begin{pmatrix}
a_1^{k+1} & 0 & \cdots & 0\\
0 & a_2^{k+1} & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & a_n^{k+1}
\end{pmatrix}$$
\(\blacksquare\)
\item \textbf{Exercise 31}
\label{sec:orge95c258}
See \textbf{Exercise 35}
\item \textbf{Exercise 32}
\label{sec:orgc3208d1}
We want to show
$$\begin{aligned}
^t(A^{-1})&=(^t A)^{-1}\\
^t(A^{-1})\cdot ^t (A)&=(^t A)^{-1} \cdot (^tA)\\
^t(A^{-1})\cdot ^t (A)&=I_n\\
\end{aligned}$$
Let \(C=^t(A^{-1})\cdot ^t (A)\). We then know
$$\begin{aligned}
c_{ij}&=\sum\limits_{k=1}^n a^{\prime -1}_{ik} a^{\prime}_{kj}\\
&=\sum\limits_{k=1}^n a_{jk} a^{-1}_{ki}\\
&=A_j\cdot A^{-1\ i}
\end{aligned}$$
Thus,
$$\begin{aligned}
C&=^t(A\cdot A^{-1})\\
&=^t(I_n)=I_n
\end{aligned}$$
If we do it in the reverse way, then we can prove it.
\item \textbf{Exercise 33}
\label{sec:org1e2a725}
Let \(B=^t (\bar{A})\), then \(b_{ij}=\bar{a}_{ji}\). Let \(C=\overline{^t A}\), then \(c_{ij}=\bar{a^{\prime}}_{ij}=\bar{a}_{ji}\). Thus, \(B=C\).
\item \textbf{Exercise 34}
\label{sec:orgab7ab99}
Its inverse is
$$\begin{pmatrix}
\frac{1}{a_1} & 0 & \cdots & 0\\
0 & \frac{1}{a_2} & \cdots & 0\\
\vdots & \vdots & \ddots & \vdots \\
0 & 0 & \cdots & \frac{1}{a_n}
\end{pmatrix}$$
\item \textbf{Exercise 35}
\label{sec:orgf99b135}
See solution manual. Here I would not like to introduce complex formal reasoning to simulate computation result.
\item \textbf{Exercise 36}
\label{sec:orgfa61aa7}
