note.tex

By result of \textbf{Exercise 35} we see that \(N^{n+1}=O\) as \(N=A-I_n\) is of the form being described in \textbf{Exercise 35}.\\
For inverse part, see \textbf{Exercise 18}.
\item \textbf{Exercise 37}
\label{sec:orgfd1b651}
$$(I-N)(I+N+\cdot +N^r)=I^{r+1}-N^{r+1}=I^{r+1}=I$$
\item \textbf{Exercise 38}
\label{sec:org96be8aa}
See solution manual for detail computation.
\item \textbf{Exercise 39}
\label{sec:orga8d40c6}
Since we know \(AB=BA\) or \(A,B\) fulfills \textbf{SP 1}, we may say
$$(AB)^r=A^rB^r=O$$
For \((A+B)\), we discuss \((A+B)^{2r}\) where \(r\) is the larger \(r\) for \(A\) and \(B\).
$$(A+B)^{2r}=\sum _{k=0}^{2r}{\binom {2r}{k}}A^{2r-k}B^{k}$$
If \(1\geq k\leq r\), then \(2r-k\geq r\) and \(A^{2r-k}=O\). If \(r<k \leq 2r\), then \(B^k=O\). Thus, essentially, \((A+B)^{2r}=O\).
\end{enumerate}
\section{Chapter 3}
\label{sec:org667de34}
\subsection{\(\S\) 1}
\label{sec:org46fefe1}
\subsubsection{Notes}
\label{sec:org6d22267}
If we want to say that \(S\) is the image of \(A\) under \(F\), we are essentially trying to say followings:
$$\begin{aligned}
&\forall z\in S, \exists x:F(x)=z. \Rightarrow S\subset F(A)\\
&\forall a\in A, F(a)\in S. \Rightarrow F(A)\subset S
\end{aligned}$$
Above are exactly what \textbf{Example 6} on Pg. 45 are saying.\\
Also, we shall work on the equality of two linear mappings. Two linear mappings \(F:S_1\rightarrow T_1 ,G:S_2\rightarrow T_2\) are said to be equal if and only if followings are fulfilled:
$$\begin{aligned}
S_1&=S_2\\
T_1&=T_2\\
\forall z\in S_1, F(z)&=G(z)
\end{aligned}$$
Proofs left to readers on Pg. 49.\\
 \emph{If \(u_1,u_2\) are elements of \(V\), then \(T_{u_1+u_2}=T_{u_1}\circ T_{u_2}\).}\\
$$\begin{aligned}
\forall v\in V, T_{u_1+u_2}&=(u_1+u_2)+v\\
&=u_1+(u_2+v)\\
&=T_{u_1}(u_2+v)\\
&=T_{u_1}(T_{u_2}(v))\\
&=T_{u_1}\circ T_{u_2}(v)
\end{aligned}$$
Which means that \(T_{u_1+u_2}=T_{u_1}\circ T_{u_2}\) according to our definition of linear mapping equality.\\
\emph{If \(u\) is an element of \(V\), then \(T_u:V\rightarrow V\) has an inverse mapping which is nothing but the translation \(T_{-u}\).}\\
First, it is easy to verify that \(T_{-u}\) is an inverse of \(T_u\). Then, we say that there is an inverse \(T_u^{-1}\). According to the definition of inverse of a linear mapping, we have, for every \(v\in V\) that
$$\begin{aligned}
T_u^{-1}(T_u(v))&=I_V(v)=v\\
T_u^{-1}(v+u)&=v\\
T_u^{-1}(x)&=x-u && \text{Let } x=v+u\\
\end{aligned}$$
which attests \(T_{u}^{-1}=T_{-u}\).\\
Here comes words on bijectivity, inverse and function composition:\\
\begin{enumerate}
\item For two mappings \(F:S_1\rightarrow T_1\) and \(F:S_2\rightarrow T_2\), \(F\circ G\) is only defined if \(T_1=S_2\).\\
\item A more clear proof for \emph{If \(F:S\rightarrow V\) has an inverse \(G:V\rightarrow S\), then \(F\) is bijective.} \emph{Proof.} If \(F(x)=F(y)\) given \(x,y\in S\), then \(G(F(x))=G(F(y))\). Also, since \(F,G\) are inverse of each other, we have
\end{enumerate}
$$\begin{aligned}
&\forall s\in S, (G\circ F)(s)=G(F(s))=I_s(s)=s\\
&\forall v\in V, (F\circ G)(v)=F(G(v))=I_v(v)=v
\end{aligned}$$
which means \(x=G(F(x))=G(F(y))=y\). Also, we contend that \(\forall v\in V, \exists x: F(x)=v\). Since we know \(\forall v\in V, (F\circ G)(v)=F(G(v))=I_v(v)=v\), we can simply let \(x=G(v)\) so that \(F(x)=v\). This proves the theorem.
\subsubsection{Exercises}
\label{sec:orge006821}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:orgb9da707}
\emph{\textbf{Calculus involved, not doing now.}}
\item \textbf{Exercise 2}
\label{sec:org454a002}
Proved in notes.
\item \textbf{Exercise 3}
\label{sec:orgb6ac873}
\begin{enumerate}
\item \(L(X)=11\)
\label{sec:org5349ac1}
\item \(L(X)=13\)
\label{sec:org39b2239}
\item \(L(X)=6\)
\label{sec:orge90ec5e}
\end{enumerate}
\item \textbf{Exercise 4}
\label{sec:org4dbe457}

\(F(1)=(e,1)\), \(F(0)=(1,0)\), \(F(-1)=(e^{-1},-1)\)
\item \textbf{Exercise 5}
\label{sec:org2ed54e6}

\((F+G)(1)=(e+1,3)\), \((F+G)(2)=(e^2+2,6)\), \((F+G)(0)=(1,0)\)
\item \textbf{Exercise 6}
\label{sec:org182c220}

\((2F)(0)=(2,0)\), \((\pi F)(1)=(\pi e,\pi)\)
\item \textbf{Exercise 7}
\label{sec:org5704a93}
For (a), it is 1. For (b), it is 11.
\item \textbf{Exercise 8}
\label{sec:org1ccf090}

The image is a ellipse of the equation
$$\frac{u^2}{4}+\frac{w^2}{9}=1$$
Proof is omitted.
\item \textbf{Exercise 9}
\label{sec:org27eb0ad}

The image is a straight line
$$y=\frac{1}{2}x$$
\emph{Proof.} \(A=\{(2,y)|y\in \mathbb{R}\}\), \(S=\{(2x,x)|x\in \mathbb{R}\}\). We contend that \(\forall a\in A, F(a)\in S\).
$$\forall y\in \mathbb{R}, F(2,y)=(2y,y)\in S$$
Conversely, \(\forall s=(x,\frac{1}{2}x)\in S\), let \(a=(2,\frac{1}{2}x)\in A\), so that \(F(a)=s\), which means \(S\subset F(A)\).
\item \textbf{Exercise 10}
\label{sec:org047a5a5}
It is a circle of center \((0,0)\) and radius \(e^c\). Proof is omitted.
\item \textbf{Exercise 11}
\label{sec:orgf9b654b}

It is a cylinder of radius 1 and center \((0,0)\). Proof is omitted.
\item \textbf{Exercise 12}
\label{sec:orgf1225e8}
\(x^2+y^2=1\). Proof is omitted.
\end{enumerate}
\subsection{\(\S\) 2}
\label{sec:org005ac5a}
\subsubsection{Notes}
\label{sec:org86d6e3f}
\label{org21f89ed}
Here we have an important \textbf{Lemma}\\
\emph{Let \(F:V\rightarrow W\) is a linear mapping. If for some \(v_i\in V\), we have \(F(v_i)\) are linear independent, then \(v_i\) are linear independent.}\\
\emph{Proof.} If \(\sum\limits_{i=1}^n t_i v_i=O\), then we have
$$\begin{aligned}
\sum\limits_{i=1}^n t_i v_i&=O\\
F(\sum\limits_{i=1}^n t_i v_i)&=F(O)=O && \text{(This is ensured as "output" of a mapping is unique for same "input")}\\
\sum\limits_{i=1}^n t_i F(v_i)=O
\end{aligned}$$
which means if \(\sum\limits_{i=1}^n t_i v_i=O\), we must have \(\sum\limits_{i=1}^n t_i F(v_i)=O\). Since \(F(v_i)\) are linear independent, we obtain that \(t_i\) is always equal to \(0\), which is another word for \(v_i\) are linear independent.\\
It is noteworthy that reversal of this \textbf{Lemma} is \textbf{NOT} always true as \(F(v)=O\) doesn't ensure that \(v=O\). In fact, in later subsections, we shall see that \(F\) is injective if and only if \(\text{Ker } F={O}\).
\subsubsection{Exercises}
\label{sec:org839a36e}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:orge97b215}
Only (a), (b), (d), (e), (f), (h) are linear mappings. For (h), it involves \textbf{\emph{Calculus}}.
\item \textbf{Exercise 2}
\label{sec:orgbc9ef76}
\(T(O)=T[v+(-v)]=T(v)+T(-v)=T(v)-T(v)=O\)
\item \textbf{Exercise 3}
\label{sec:orgaebbf20}
\(T(u+v)=T(u)+T(v)=w+O=w\)
\item \textbf{Exercise 4}
\label{sec:org4939134}

Let the set of elements \(v\in V\) satisfying \(T(v)=w\) be \(S\). We contend that \(\forall v\in S, \exists u\in U:v=u+v_0\).\\
\emph{Proof.} let \(u=v-v_0\). \(F(u)=F(v-v_0)=F(v)-F(v_0)=O\). Thus, \(v\in U\). This means \(S\subset (v_0+U)\).\\
Conversely, we contend that \(\forall u\in U\), we have \((v_0+u)\in S\).\\
\emph{Proof.} \(T(v_0+u)=T(v_0)+T(u)=w+O=w\). This means \((v_0+U)\subset S\).\\
Thus, \(S=(v_0+U)\).
\item \textbf{Exercise 5}
\label{sec:orgaa7081d}
As \textbf{Exercise 2} said, \(T(O)=T(v-v)=T(v)+T(-v)=O \Rightarrow T(-v)=-T(v)\).
\item \textbf{Exercise 6}
\label{sec:org514b5cb}

Firstly, \(F(v_1+v_2)=(f(v_1)+f(v_2),g(v_1)+g(v_2))=(f(v_1),g(v_1))+(f(v_2),g(v_2))=F(v_1)+F(v_2)\) \\
Secondly, \(F(cv)=(cf(v),cg(v))=c(f(v),g(v))=cF(v)\)
\item \textbf{Exercise 7}
\label{sec:orgd9ef7b5}
\begin{enumerate}
\item Prove \((u_1+u_2)\in U\). We have \(F(u_1+u_2)=F(u_1)+F(u_2)=O+O=O\).
\item Prove \(cu\in U\). We have \(F(cu)=cF(u)=O\).
\end{enumerate}
\item \textbf{Exercise 8}
\label{sec:orgac9de2f}
Mapping 8 is linear, others are not.
\item \textbf{Exercise 9}
\label{sec:org022c05b}

By definition later introduced in \(\S 5\), it is line segment between \(F(v)\) and \(F(v+w)\).\\
If \(F(w)\not = O\), then it is a line segment. If \(F(w)=O\), then it is a point.
\item \textbf{Exercise 10}
\label{sec:org3f37ddd}
By definition, it is a parallelogram.
\item \textbf{Exercise 11}
\label{sec:orgf3a358e}
Note that \(E_1,E_2\) are standard generators.
Since \(S\) is a set of points that can be written in the form \(t_1E_1+t_2E_2\) where \(0\leq t_1\leq 1\) and \(0\leq t_2\leq 1\). Thus, \(F(t_1E_1+t_2E_2)=t_1F(E_1)+t_2F(E_2)\) where \(0\leq t_1\leq 1\) and \(0\leq t_2\leq 1\). Hence, prove the statement.
\item \textbf{Exercise 12}
\label{sec:orge27a82c}
We know \(3E_1\) and \(E_2\) are also linear independent. So are \(3F(E_1)\) and \(F(E_2)\). Thus, adopting similar reasoning in \textbf{Exercise 11}, we prove statement.
\item \textbf{Exercise 13}
\label{sec:orgcc80cb2}
It is a parallelogram generated by \(5A\) and \(2B\).
\item \textbf{Exercise 14}
\label{sec:org9168fc7}
\(T_u(v_1+v_2)=v_1+v_2+u=T_u(v_1)+T_u(v_2)=v_1+v_2+2u\). Thus, we have \(2u=u\) and \(u=O\).
\item \textbf{Exercise 15}
\label{sec:org822a8a8}
It is shown in \hyperref[org21f89ed]{Lemma}.
\item \textbf{Exercise 16}
\label{sec:orge28e553}
