note.tex

If \(v\in W\), simply let \(c=0\) and \(w=v\).\\
If \(v\not \in W\), let \(c=\frac{F(v)}{F(v_0)}\) and \(w=v-cv_0\). We then contend that \(w\in W\). Since \(F(w)=F(v-cv_0)=F(v)-cF(v_0)=0\), we conclude \(w\in W\). Thus, concludes.
\item \textbf{Exercise 17}
\label{sec:org9b09cb8}

We see that \(F(w_1+w_2)=F(w_1)+F(w_2)=0+0=0\). Also, \(F(cw)=cF(w)=0\). And since \(F\) is linear and as we proved before, \(F(O)=O\) and \(O\in W\). Thus, \(W\) is a subspace of \(V\).\\
We know by \textbf{Exercise 16} that \(\{v_0,v_1,\cdots , v_n\}\) generates \(V\). We contend then that they are linear independent. It is by definition that \(\{v_1,\cdots , v_n\}\) are linear independent. Since \(v_0\not \in W\), we see that \(v_0\) cannot be expressed by linear combination of \(\{v_0,v_1,\cdots , v_n\}\), \hyperref[org9a76a6d]{thereby} \(v_0\) is linear independent from others. Thus, they are linear independent. Then, by definition, this set is a basis of \(V\).
\item \textbf{Exercise 18}
\label{sec:org8a13df1}
\begin{enumerate}
\item \((-1,-1)\)
\item \((-\frac{2}{3},1)\)
\item \((-2,-1)\)
\end{enumerate}
\item \textbf{Exercise 19}
\label{sec:orgff4de0f}
\begin{enumerate}
\item \((4,5)\)
\item \((\frac{11}{3},-3)\)
\item \((4,2)\)
\end{enumerate}
\end{enumerate}
\subsection{\(\S\) 3}
\label{sec:orga8e07f7}
\subsubsection{Notes}
\label{sec:orgfd538c0}
Another part for \textbf{Theorem 3.3}. If \(\text{Im } L=W\), then \(\dim \text{Im } L=\dim W\) and \(\dim \text{Ker }L=0\). Thus, \(\text{Ker } L=\{O\}\).
\subsubsection{Exercises}
\label{sec:orgaeffbd5}
\begin{enumerate}
\item \textbf{Exercise 1}
\label{sec:org17ddacf}

We know \(\dim \mathbb{R}^{n}=n\). According to rank-nullity law, we see that \(\dim \mathbb{R}^2=\dim \text{Ker }F+\dim \text{Im }F\). Thus, \(2=\dim \text{Ker }F+n\) and \(2-n=\dim \text{Ker }F\) Since \(n,\dim \text{Ker }F\geq 0\), we see that \(0\leq n\leq 2\).
\begin{enumerate}
\item \(n=2\), then \(\dim \text{Ker }F=0\) and \(\text{Ker }F=\{O\}\). This means that \(t_1F(A)+t_2F(B)=O \Rightarrow F(t_1A+t_2B)=O \Rightarrow t_1A+t_2B=O \Rightarrow t_1=t_2=0\).
\item \(n=1\), then \(\dim \text{Im }F=1\).
\item \(n=0\), then \(\dim \text{Im }F=0\) and \(\text{Im }F=\{O\}\).
\end{enumerate}
\item \textbf{Exercise 2}
\label{sec:orgf34f63c}

We know then that \(\dim \text{Ker }F\not =0\). Since \(2-\dim \text{Ker } F=\dim \text{Im }F\), we see that \(\dim \text{Im }F=0\) or \(1\). This concludes our prove.
\item \textbf{Exercise 3}
\label{sec:org50251f0}
Consider \(L:\mathbb{R}^4\rightarrow \mathbb{R}^2\) such that \(L(x_1,x_2,x_3,x_4)=L(x_1+2x_2,x_3-15x_4)\). According to rank-nullity theorem and since \(\text{Ker }L=W\), we see that \(\dim \mathbb{R}^4=\dim W+\dim \mathbb{R}^{2}\). Thus \(\dim W=2\).
\item \textbf{Exercise 4}
\label{sec:orgf12cb63}
We contend that there exists such a \(u\). \(\forall X\), \(L(X-v_0)=L(X)-L(v_0)=O\). This means if we let \(u=X-v_0\), then \(u\in \text{Ker }L\).
\item \textbf{Exercise 5-9}
\label{sec:org7ace46b}
\emph{\textbf{Calculus Involved, not done now.}}
\item \textbf{Exercise 10}
\label{sec:org5b766b5}

\begin{enumerate}
\item Let such a subspace be \(W\). Consider \(L:\mathbb{R}^n\rightarrow \mathbb{R}\) such that \(L(X)=\sum\limits_{i=1}^n x_i\). According to rank-nullity theorem and since \(\text{Ker }L=W\), we see that \(\dim \mathbb{R}^n=\dim W+\dim \mathbb{R}\). Thus \(\dim W=n-1\).
\item Let such a subspace be \(W\). Consider \(tr:\text{Mat}_{n\times n}(\mathbb{R})\rightarrow \mathbb{R}\) such that \(tr(A)=\sum\limits_{i=1}^n a_ii\). According to rank-nullity theorem and since \(\text{Ker }tr=W\), we see that \(\dim \text{Mat}_{n\times n}(\mathbb{R})=\dim W+\dim \mathbb{R}\). Thus \(\dim W=n^2-1\).
\end{enumerate}
\item \textbf{Exercise 11}
\label{sec:org9987eef}
\begin{enumerate}
\item We have \(tr(A+B)=\sum\limits_{i=1}^n(a_{ii}+b_{ii})=\sum\limits_{i=1}^n a_{ii}+\sum\limits_{i=1}^n b_{ii}=tr(A)+tr(B)\) and \(tr(cA)=\sum\limits_{i=1}^n(ca_{ii})=c\sum\limits_{i=1}^n a_{ii}=c\cdot tr(A)\). This concludes linearity for \(tr\).
\item $$\begin{aligned}
   tr(AB)&=\sum\limits_{i=1}^n A_iB^i\\
   &=\sum\limits_{i,j=1}^n a_{ij}b_{ji}\\
   &=\sum\limits_{i,j=1}^n b_{ji}a_{ij}\\
   &=\sum\limits_{i=1}^{n} B_iA^i\\
   &=tr(BA)\\
   \end{aligned}$$
\item Since we know \(tr(AB)=tr(BA)\), we have \(tr[(B^{-1}A)B]=tr[B(B^{-1}A)]=tr[(BB^{-1})A]=tr(I_nA)=tr(A)\)
\item Firstly, \(\langle A,B \rangle = tr(AB)=tr(BA)=\langle B,A \rangle\). Secondly, \(\langle A,B+C \rangle=tr[A(B+C)]=tr[AB+AC]=tr(AB)+tr(AC)=\langle A,B\rangle+\langle A,C\rangle\). Thirdly, \(c\langle A,B \rangle=c\sum\limits_{i=1}^n A_iB^i=\sum\limits_{i=1}^n (cA_i)B^i=\langle cA,B \rangle\).
\item \(tr(AB-BA)=tr(AB)-tr(BA)=0\). Since \(tr(I_n)=n\), this could not be possible.
\end{enumerate}
\item \textbf{Exercise 12}
\label{sec:org679ad2a}
\(\dim S=\frac{n(n+1)}{2}\). Basis are trivial, skipped.
\item \textbf{Exercise 13}
\label{sec:org8fd5644}
\(tr(AA)=\sum\limits_{i,j=1}^n a_{ij}a_{ji}=\sum\limits_{i,j=1}^n (a_{ij})^2\geq 0\)
\end{enumerate}
\end{document}
